Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: GoogleTest provides PrintToStringParamName, or a custom function can be used for more control:
it_it: GoogleTest fornisce PrintToStringParamName, oppure è possibile utilizzare una funzione personalizzata per un maggiore controllo:

source: GoogleTest provides [`PrintToStringParamName`](#PrintToStringParamName), or a custom function can be used for more control:
it_it: GoogleTest fornisce [`PrintToStringParamName`](#PrintToStringParamName), oppure è possibile utilizzare una funzione personalizzata per un maggiore controllo:

source: GoogleTest provides [assertions](primer.md#assertions) that you use to test the behavior of your code.
it_it: GoogleTest fornisce [asserzioni](primer.md#assertions) utilizzate per testare il comportamento del codice.

source: GoogleTest provides a built-in library of matchers—see the Matchers Reference.
it_it: GoogleTest fornisce una libreria nativa di matcher: consultare i Riferimenti ai Matcher.

source: GoogleTest provides a built-in library of matchers—see the [Matchers Reference](matchers.md).
it_it: GoogleTest fornisce una libreria nativa di matcher: consultare i [Riferimenti ai Matcher](matchers.md).

source: GoogleTest provides a collection of assertions for verifying the behavior of your code in various ways.
it_it: GoogleTest fornisce una raccolta di asserzioni per verificare il comportamento del codice in vari modi.

source: GoogleTest provides an **event listener API** to let you receive notifications about the progress of a test program and test failures.
it_it: GoogleTest fornisce una **event listener API** per ricevere notifiche sull'avanzamento di un programma di test e sugli errori dei test.

source: GoogleTest provides an event listener API to let you receive notifications about the progress of a test program and test failures.
it_it: GoogleTest fornisce una event listener API per ricevere notifiche sull'avanzamento di un programma di test e sugli errori dei test.

source: GoogleTest provides assertion macros to support death tests.
it_it: GoogleTest fornisce macro di asserzioni per supportare i death test.

source: GoogleTest provides some built-in matchers for 2-tuples, including the Lt() matcher above.
it_it: GoogleTest fornisce alcuni matcher nativi per 2-tuple (doppie), incluso il matcher Lt() sopra.

source: GoogleTest provides some built-in matchers for 2-tuples, including the `Lt()` matcher above.
it_it: GoogleTest fornisce alcuni matcher nativi per 2-tuple (doppie), incluso il matcher `Lt()` sopra.

source: GoogleTest provides two predicates to handle common cases:
it_it: GoogleTest fornisce due predicati per gestire i casi comuni:

source: GoogleTest recently started replacing the term *Test Case* with *Test Suite*.
it_it: GoogleTest ha recentemente iniziato a sostituire il termine *Test Case* con *Test Suite*.

source: GoogleTest recently started replacing the term Test Case with Test Suite.
it_it: GoogleTest ha recentemente iniziato a sostituire il termine Test Case con Test Suite.

source: GoogleTest reserves the right to change how the work is distributed across the shards, but here's one possible scenario:
it_it: GoogleTest si riserva il diritto di modificare la modalità di distribuzione del lavoro tra gli shard, ma ecco uno scenario possibile:

source: GoogleTest takes the ownership.
it_it: GoogleTest ne assume la proprietà.

source: GoogleTest test programs are ordinary executables.
it_it: I programmi di test di GoogleTest sono normali eseguibili.

source: GoogleTest's *break-on-failure* mode supports this behavior.
it_it: La modalità *break-on-failure* di GoogleTest supporta questo comportamento.

source: GoogleTest's break-on-failure mode supports this behavior.
it_it: La modalità break-on-failure di GoogleTest supporta questo comportamento.

source: GoogleTest, of course.
it_it: GoogleTest, ovviamente.

source: Googletest Samples
it_it: Esempi di Googletest

source: Guides
it_it: Guide

source: Guides:
it_it: Guide:

source: Has Type
it_it: Ha il Tipo

source: Have you noticed that a matcher is just a fancy predicate that also knows how to describe itself?
it_it: Si è notato che un matcher è solo un fantasioso predicato che sa anche come descrivere se stesso?

source: Having more constraints than necessary is baaad - even worse than not having enough constraints.
it_it: Avere più vincoli del necessario è una pessima idea - anche peggio che non avere abbastanza vincoli.

source: Having an ON_CALL in the set-up part of a test doesn't mean that the calls are expected.
it_it: Avere un ON_CALL nella parte del set-up di un test non significa che le chiamate siano previste [expected].

source: Having an `ON_CALL` in the set-up part of a test doesn't mean that the calls are expected.
it_it: Avere un `ON_CALL` nella parte del set-up di un test non significa che le chiamate siano previste [expected].

source: Having more constraints than necessary is *baaad* - even worse than not having enough constraints.
it_it: Avere più vincoli del necessario è *una pessima idea* - anche peggio che non avere abbastanza vincoli.

source: Having the right tool absolutely makes the difference.
it_it: Avere lo strumento giusto fa assolutamente la differenza.

source: Having to mix a mock and a fake is often a sign of something gone wrong.
it_it: Dover mischiare una mock con una fake è spesso un segno che qualcosa è andato storto.

source: Help!
it_it: Aiuto!

source: Hence it is vitally important to test that such assertion statements work as expected.
it_it: Pertanto è di vitale importanza verificare che tali affermazioni funzionino come previsto.

source: Here #2 can be used only once, so if you have two warnings with the message "File too large.", the first will match #2 and the second will match #1 - there will be no error.
it_it: Qui #2 può essere utilizzato solo una volta, quindi se si hanno due warning con il messaggio "File too large.", il primo corrisponderà [match] a #2 e il secondo corrisponderà a #1: non ci sarà errore.

source: Here #2 can be used only once, so if you have two warnings with the message `"File too large."`, the first will match #2 and the second will match #1 - there will be no error.
it_it: Qui #2 può essere utilizzato solo una volta, quindi se si hanno due warning con il messaggio `"File too large."`, il primo corrisponderà [match] a #2 e il secondo corrisponderà a #1: non ci sarà errore.

source: Here my_mock.GetPrevValue() will always return the argument of the last UpdateValue() call.
it_it: Qui my_mock.GetPrevValue() restituirà sempre l'argomento dell'ultima chiamata UpdateValue().

source: Here `my_mock.GetPrevValue()` will always return the argument of the last `UpdateValue()` call.
it_it: Qui `my_mock.GetPrevValue()` restituirà sempre l'argomento dell'ultima chiamata `UpdateValue()`.

source: Here are more tips:
it_it: Ecco ulteriori suggerimenti:

source: Here's an example:
it_it: Ecco un esempio:

source: Here's an example of each:
it_it: Ecco un esempio di ciascuno:

source: Here's an example of per-test-suite set-up and tear-down:
it_it: Ecco un esempio di configurazione e dismissione "per-test-suite":

source: Here's an example to make it clear.
it_it: Ecco un esempio per chiarire.

source: Here's how it works:
it_it: Ecco come funziona:

source: Here's how to use it:
it_it: Ecco come usarlo:

source: Here's how you can define NotNull() as an example:
it_it: Ecco un esempio di come si possa definire NotNull():

source: Here's how you can define `NotNull()` as an example:
it_it: Ecco un esempio di come si possa definire `NotNull()`:

source: Here's how you do it:
it_it: Ecco come farlo:

source: Here's how.
it_it: Ecco come.

source: Here's how:
it_it: Ecco come:

source: Here's one example:
it_it: Ecco un esempio:

source: Here's the definition of a mock class before applying this recipe:
it_it: Ecco la definizione di una classe mock prima di applicare questa ricetta:

source: Here's the syntax:
it_it: Ecco la sintassi:

source: Historically, GoogleTest started to use the term *Test Case* for grouping related tests, whereas current publications, including International Software Testing Qualifications Board ([ISTQB](https://www.istqb.org/)) materials and various textbooks on software quality, use the term *[Test Suite][istqb test suite]* for this.
it_it: Storicamente, GoogleTest ha iniziato a utilizzare il termine *Test Case* per raggruppare test correlati, mentre le pubblicazioni attuali, inclusi i materiali dell'International Software Testing Qualifications Board ([ISTQB](https://www.istqb.org/)) e vari libri di testo sulla qualità del software, utilizzano il termine *[Test Suite][istqb test suite]* per questo.

source: Historically, GoogleTest started to use the term Test Case for grouping related tests, whereas current publications, including International Software Testing Qualifications Board (ISTQB) materials and various textbooks on software quality, use the term Test Suite for this.
it_it: Storicamente, GoogleTest ha iniziato a utilizzare il termine Test Case per raggruppare test correlati, mentre le pubblicazioni attuali, inclusi i materiali dell'International Software Testing Qualifications Board (ISTQB) e vari libri di testo sulla qualità del software, utilizzano il termine Test Suite per questo.

source: Historically, the EXPECT_EQ() macro took the expected value as its first argument and the actual value as the second, though this argument order is now discouraged.
it_it: Storicamente, la macro EXPECT_EQ() prendeva il valore expected come primo argomento e il valore actual come secondo, sebbene l'ordine degli argomenti ora sia scoraggiato.

source: Historically, the `EXPECT_EQ()` macro took the *expected* value as its first argument and the *actual* value as the second, though this argument order is now discouraged.
it_it: Storicamente, la macro `EXPECT_EQ()` prendeva il valore *expected* come primo argomento e il valore *actual* come secondo, sebbene l'ordine degli argomenti ora sia scoraggiato.

source: Hopefully this will remind you to take a look and see if there is indeed a problem.
it_it: Si spera che questo ricordi di dare un'occhiata e vedere se c'è davvero un problema.

source: Hopefully, a flaky test will eventually fail and give you a chance to debug.
it_it: Si spera che un test instabile alla fine fallisca e dia la possibilità di eseguire il debug.

source: How It Works
it_it: Come Funziona

source: How can I assert that a function is NEVER called?
it_it: Come posso asserire che una funzione non viene MAI chiamata?

source: How can I delete the mock function's argument in an action?
it_it: Come si può eliminare l'argomento della funzione mock in un'azione?

source: How can I perform an arbitrary action on a mock function's argument?
it_it: Come posso eseguire un'azione arbitraria sull'argomento di una funzione mock?

source: How can I see the LOG messages when the death test succeeds?
it_it: Come posso vedere i messaggi di LOG quando il death test ha successo?

source: How can my code detect if it is running in a test?
it_it: Come può il mio codice rilevare se è in esecuzione in un test?

source: How can you find out the cause?
it_it: Come scoprirne la causa?

source: How could it be that your mock object won't eventually be destroyed?
it_it: Come è possibile che l'oggetto mock alla fine non venga distrutto?

source: How could tests that verify more be worse than tests that verify less?
it_it: Come potrebbero i test che verificano di più essere peggiori dei test che verificano di meno?

source: How do I fix it?
it_it: Come lo si ripara?

source: How do I suppress the memory leak messages on Windows?
it_it: Come sopprimere i messaggi riguardo ai memory leak su Windows?

source: How do I temporarily disable a test?
it_it: Come disattivare temporaneamente un test?

source: How does this affect uninteresting calls and unexpected calls?
it_it: In che modo ciò influisce sulle chiamate uninteresting e le unexpected?

source: How that happens depends on the platform and the variable ::testing::GTEST_FLAG(death_test_style), which is initialized from the command-line flag --gtest_death_test_style.
it_it: Il modo in cui ciò accade dipende dalla piattaforma e dalla variabile ::testing::GTEST_FLAG(death_test_style), che viene inizializzata dal flag della riga di comando --gtest_death_test_style.

source: How that happens depends on the platform and the variable `::testing::GTEST_FLAG(death_test_style)`, which is initialized from the command-line flag `--gtest_death_test_style`.
it_it: Il modo in cui ciò accade dipende dalla piattaforma e dalla variabile `::testing::GTEST_FLAG(death_test_style)`, che viene inizializzata dal flag della riga di comando `--gtest_death_test_style`.

source: How to Define It
it_it: Come la si Definisce

source: How to Write Value-Parameterized Tests
it_it: Come Scrivere Test con Valori Parametrizzati

source: How to Write a Death Test
it_it: Come Scrivere un Death Test

source: How would you test that it does the right thing?
it_it: Come provare che faccia la cosa giusta?

source: How would you test that the turtle is asked to go to the origin *exactly twice* (you want to ignore any other instructions it receives)?
it_it: Come verificare che alla tartaruga venga chiesto di andare all'origine *esattamente due volte* (ignorare qualsiasi altra istruzione ricevuta)?

source: How would you test that the turtle is asked to go to the origin exactly twice (you want to ignore any other instructions it receives)?
it_it: Come verificare che alla tartaruga venga chiesto di andare all'origine esattamente due volte (ignorare qualsiasi altra istruzione ricevuta)?

source: However because their types can be long and rarely provide meaningful information, it can be easier to express them with C++14 generic lambdas to avoid specifying types.
it_it: Tuttavia, poiché i tipi possono essere lunghi e raramente forniscono informazioni significative, può essere più semplice esprimerli con le generiche lambda di C++14 per evitare di specificare i tipi.

source: However, I have to write the expectations in the
it_it: Devo però scrivere le expectation

source: However, a better approach is to move the private code into the foo::internal namespace, where foo is the namespace your project normally uses, and put the private declarations in a *-internal.h file.
it_it: Tuttavia, un approccio migliore è quello di spostare il codice privato nel namespace foo::internal, dove foo è il namespace normalmente utilizzato dal progetto, e inserire le dichiarazioni private in un file *-internal.h.

source: However, a better approach is to move the private code into the `foo::internal` namespace, where `foo` is the namespace your project normally uses, and put the private declarations in a `*-internal.h` file.
it_it: Tuttavia, un approccio migliore è quello di spostare il codice privato nel namespace `foo::internal`, dove `foo` è il namespace normalmente utilizzato dal progetto, e inserire le dichiarazioni private in un file `*-internal.h`.

source: However, as we shall reveal soon, gMock allows you to do so much more with the mocks.
it_it: Tuttavia, come vedremo presto, gMock permette di fare molto di più con i mock.

source: However, as we shall reveal soon, gMock allows you to do *so much more* with the mocks.
it_it: Tuttavia, come vedremo presto, gMock permette di fare *molto di più* con i mock.

source: However, consider this:
it_it: Tuttavia, c'è questo da considerare:

source: However, gMock doesn't let you use ReturnRef() in a mock function whose return type is not a reference, as doing that usually indicates a user error.
it_it: Tuttavia, gMock non consente di utilizzare ReturnRef() in una funzione mock il cui tipo restituito non è un riferimento, poiché ciò di solito indica un errore dell'utente.

source: However, gMock doesn't let you use `ReturnRef()` in a mock function whose return type is not a reference, as doing that usually indicates a user error.
it_it: Tuttavia, gMock non consente di utilizzare `ReturnRef()` in una funzione mock il cui tipo restituito non è un riferimento, poiché ciò di solito indica un errore dell'utente.

source: However, if the action has its own state, you may be surprised if you share the action object.
it_it: Tuttavia, se l'azione ha un proprio stato, si potrebbe rimanere sorpresi se si condivide l'oggetto dell'azione.

source: However, if you *really*, *really*, *really* have no choice, and if you follow the rule of ending your test program names with `_test`, you can use the *horrible* hack of sniffing your executable name (`argv[0]` in `main()`) to know whether the code is under test.
it_it: Tuttavia, se *davvero*, *davvero*, *davvero* non si ha scelta e se si segue la regola di terminare i nomi dei programmi di test con `_test`, si può usare il trucco *orribile* di sniffare il nome dell'eseguibile (`argv[0]` in `main()`) per sapere se il codice è in fase di test.

source: However, if you really, really, really have no choice, and if you follow the rule of ending your test program names with _test, you can use the horrible hack of sniffing your executable name (argv[0] in main()) to know whether the code is under test.
it_it: Tuttavia, se davvero, davvero, davvero non si ha scelta e se si segue la regola di terminare i nomi dei programmi di test con _test, si può usare il trucco orribile di sniffare il nome dell'eseguibile (argv[0] in main()) per sapere se il codice è in fase di test.

source: However, if you don't control which machine your test runs on, you shouldn't depend on this.
it_it: Tuttavia, se non si controlla su quale macchina viene eseguito il test, non si dovrebbe dipendere da questo.

source: However, if you rewrite your test to use NiceMock<MockFoo> instead, you can suppress the warning:
it_it: Tuttavia, se si riscrive il test per utilizzare invece NiceMock<MockFoo>, si può sopprimere il warning:

source: However, if you rewrite your test to use `NiceMock<MockFoo>` instead, you can suppress the warning:
it_it: Tuttavia, se si riscrive il test per utilizzare invece `NiceMock<MockFoo>`, si può sopprimere il warning:

source: However, if you want exception handling you must do it only in the TearDown code because throwing an exception from the destructor results in undefined behavior.
it_it: Tuttavia, la gestione delle eccezioni si deve fare solo nel codice di TearDown perché lanciare un'eccezione dal distruttore provoca un comportamento indefinito.

source: However, in opt mode htonl() is defined as a macro, which breaks this usage.
it_it: Tuttavia, in modalità opt htonl() è definito come una macro, il che interrompe questo utilizzo.

source: However, in opt mode `htonl()` is defined as a *macro*, which breaks this usage.
it_it: Tuttavia, in modalità opt `htonl()` è definito come una *macro*, il che interrompe questo utilizzo.

source: However, it can also bring significant benefits in addition to better testability:
it_it: Tuttavia, si possono anche apportare benefici significativi oltre a una migliore testabilità:

source: However, sometimes tests use resources that are expensive to set up, making the one-copy-per-test model prohibitively expensive.
it_it: Tuttavia, a volte i test utilizzano risorse costose da configurare, rendendo il modello "one-copy-per-test" proibitivamente costoso.

source: However, sometimes you may want to ignore these uninteresting calls, and sometimes you may want to treat them as errors.
it_it: Tuttavia, a volte si vorrebbero ignorare queste chiamate poco interessanti, altre volte le si vorrebbe trattare come errori.

source: However, the argument evaluation order is undefined and programs should not depend on any particular argument evaluation order.
it_it: Tuttavia, l'ordine di valutazione degli argomenti non è definito e i programmi non dovrebbero dipendere da alcun particolare ordine di valutazione degli argomenti.

source: However, the following code is **not allowed** and will produce a runtime error from GoogleTest because the test methods are using different test fixture classes with the same test suite name.
it_it: Tuttavia, il codice seguente **non è consentito** e genererà un errore a runtime da GoogleTest poiché i metodi di test utilizzano classi di fixture diverse con lo stesso nome della test suite.

source: However, the following code is not allowed and will produce a runtime error from GoogleTest because the test methods are using different test fixture classes with the same test suite name.
it_it: Tuttavia, il codice seguente non è consentito e genererà un errore a runtime da GoogleTest poiché i metodi di test utilizzano classi di fixture diverse con lo stesso nome della test suite.

source: However, the implementation of the class fired all the events on a background thread, which made test timings difficult.
it_it: Tuttavia, l'implementazione della classe ha attivato tutti gli eventi su un thread in background, rendendo difficile la tempistica dei test.

source: However, there are cases where you have to define your own:
it_it: Tuttavia, ci sono casi in cui è necessario definirne uno manualmente:

source: However, there are two reasons why it may not be the case:
it_it: Tuttavia, ci sono due ragioni per cui potrebbe non essere così:

source: However, there is an easy solution to this problem.
it_it: Tuttavia, esiste una soluzione semplice a questo problema.

source: However, these macros are not very explicit about the interfaces they create and are not always suitable, especially for matchers that will be widely reused.
it_it: Tuttavia, queste macro non sono molto esplicite riguardo alle interfacce che creano e non sono sempre adatte, soprattutto per i matcher che verranno ampiamente riutilizzati.

source: However, this is awkward especially when the expression has side-effects or is expensive to evaluate.
it_it: Tuttavia, ciò risulta problematico, soprattutto quando l'espressione presenta effetti collaterali o è costosa da valutare.

source: However, this may be too coarse for your purpose: perhaps you have two mock methods with the same return type and you want them to have different behaviors.
it_it: Tuttavia, questo potrebbe essere troppo grossolano per i propri scopi: forse ci sono due metodi mock con lo stesso tipo di ritorno e si vuole che abbiano comportamenti diversi.

source: However, we may add SUCCEED messages to GoogleTest output in the future.
it_it: Tuttavia, in futuro potremmo aggiungere messaggi SUCCEED all'output di GoogleTest.

source: However, we may add `SUCCEED` messages to GoogleTest output in the future.
it_it: Tuttavia, in futuro potremmo aggiungere messaggi `SUCCEED` all'output di GoogleTest.

source: However, we strongly recommend you to write your own main() and call AddGlobalTestEnvironment() there, as relying on initialization of global variables makes the code harder to read and may cause problems when you register multiple environments from different translation units and the environments have dependencies among them (remember that the compiler doesn't guarantee the order in which global variables from different translation units are initialized).
it_it: Tuttavia, consigliamo vivamente di scrivere il main() e di chiamare AddGlobalTestEnvironment() lì, poiché fare affidamento sull'inizializzazione delle variabili globali rende il codice più difficile da leggere e potrebbe causare problemi quando si registrano più ambienti da diverse unità di traduzione e gli ambienti hanno dipendenze tra loro (ricordare che il compilatore non garantisce l'ordine in cui vengono inizializzate le variabili globali di diverse unità di traduzione).
